XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_data_1_reg.h
/**
  ******************************************************************************
  * @file    ef_data_1_reg.h
  * @version V1.0
  * @date    2021-07-31
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __EF_DATA_1_REG_H__
#define __EF_DATA_1_REG_H__

#include "bl606p.h"

/* 0x80 : ef_key_slot_4_w0 */
#define EF_DATA_1_EF_KEY_SLOT_4_W0_OFFSET (0x80)
#define EF_DATA_1_EF_KEY_SLOT_4_W0        EF_DATA_1_EF_KEY_SLOT_4_W0
#define EF_DATA_1_EF_KEY_SLOT_4_W0_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_4_W0_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_4_W0_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_4_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W0_POS)
#define EF_DATA_1_EF_KEY_SLOT_4_W0_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_4_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W0_POS))

/* 0x84 : ef_key_slot_4_w1 */
#define EF_DATA_1_EF_KEY_SLOT_4_W1_OFFSET (0x84)
#define EF_DATA_1_EF_KEY_SLOT_4_W1        EF_DATA_1_EF_KEY_SLOT_4_W1
#define EF_DATA_1_EF_KEY_SLOT_4_W1_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_4_W1_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_4_W1_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_4_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W1_POS)
#define EF_DATA_1_EF_KEY_SLOT_4_W1_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_4_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W1_POS))

/* 0x88 : ef_key_slot_4_w2 */
#define EF_DATA_1_EF_KEY_SLOT_4_W2_OFFSET (0x88)
#define EF_DATA_1_EF_KEY_SLOT_4_W2        EF_DATA_1_EF_KEY_SLOT_4_W2
#define EF_DATA_1_EF_KEY_SLOT_4_W2_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_4_W2_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_4_W2_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_4_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W2_POS)
#define EF_DATA_1_EF_KEY_SLOT_4_W2_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_4_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W2_POS))

/* 0x8C : ef_key_slot_4_w3 */
#define EF_DATA_1_EF_KEY_SLOT_4_W3_OFFSET (0x8C)
#define EF_DATA_1_EF_KEY_SLOT_4_W3        EF_DATA_1_EF_KEY_SLOT_4_W3
#define EF_DATA_1_EF_KEY_SLOT_4_W3_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_4_W3_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_4_W3_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_4_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W3_POS)
#define EF_DATA_1_EF_KEY_SLOT_4_W3_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_4_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_4_W3_POS))

/* 0x90 : ef_key_slot_5_w0 */
#define EF_DATA_1_EF_KEY_SLOT_5_W0_OFFSET (0x90)
#define EF_DATA_1_EF_KEY_SLOT_5_W0        EF_DATA_1_EF_KEY_SLOT_5_W0
#define EF_DATA_1_EF_KEY_SLOT_5_W0_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_5_W0_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_5_W0_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_5_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W0_POS)
#define EF_DATA_1_EF_KEY_SLOT_5_W0_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_5_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W0_POS))

/* 0x94 : ef_key_slot_5_w1 */
#define EF_DATA_1_EF_KEY_SLOT_5_W1_OFFSET (0x94)
#define EF_DATA_1_EF_KEY_SLOT_5_W1        EF_DATA_1_EF_KEY_SLOT_5_W1
#define EF_DATA_1_EF_KEY_SLOT_5_W1_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_5_W1_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_5_W1_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_5_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W1_POS)
#define EF_DATA_1_EF_KEY_SLOT_5_W1_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_5_W1_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W1_POS))

/* 0x98 : ef_key_slot_5_w2 */
#define EF_DATA_1_EF_KEY_SLOT_5_W2_OFFSET (0x98)
#define EF_DATA_1_EF_KEY_SLOT_5_W2        EF_DATA_1_EF_KEY_SLOT_5_W2
#define EF_DATA_1_EF_KEY_SLOT_5_W2_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_5_W2_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_5_W2_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_5_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W2_POS)
#define EF_DATA_1_EF_KEY_SLOT_5_W2_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_5_W2_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W2_POS))

/* 0x9C : ef_key_slot_5_w3 */
#define EF_DATA_1_EF_KEY_SLOT_5_W3_OFFSET (0x9C)
#define EF_DATA_1_EF_KEY_SLOT_5_W3        EF_DATA_1_EF_KEY_SLOT_5_W3
#define EF_DATA_1_EF_KEY_SLOT_5_W3_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_5_W3_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_5_W3_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_5_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W3_POS)
#define EF_DATA_1_EF_KEY_SLOT_5_W3_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_5_W3_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_5_W3_POS))

/* 0xA0 : ef_key_slot_6_w0 */
#define EF_DATA_1_EF_KEY_SLOT_6_W0_OFFSET (0xA0)
#define EF_DATA_1_EF_KEY_SLOT_6_W0        EF_DATA_1_EF_KEY_SLOT_6_W0
#define EF_DATA_1_EF_KEY_SLOT_6_W0_POS    (0U)
#define EF_DATA_1_EF_KEY_SLOT_6_W0_LEN    (32U)
#define EF_DATA_1_EF_KEY_SLOT_6_W0_MSK    (((1U << EF_DATA_1_EF_KEY_SLOT_6_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_6_W0_POS)
#define EF_DATA_1_EF_KEY_SLOT_6_W0_UMSK   (~(((1U << EF_DATA_1_EF_KEY_SLOT_6_W0_LEN) - 1) << EF_DATA_1_EF_KEY_SLOT_6_W0_POS))

