XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_data_1_reg.h
    /* 0x80 : ef_key_slot_4_w0 */
    union {
        struct {
            uint32_t ef_key_slot_4_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w0;

    /* 0x84 : ef_key_slot_4_w1 */
    union {
        struct {
            uint32_t ef_key_slot_4_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w1;

    /* 0x88 : ef_key_slot_4_w2 */
    union {
        struct {
            uint32_t ef_key_slot_4_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w2;

    /* 0x8C : ef_key_slot_4_w3 */
    union {
        struct {
            uint32_t ef_key_slot_4_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_4_w3;

    /* 0x90 : ef_key_slot_5_w0 */
    union {
        struct {
            uint32_t ef_key_slot_5_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w0;

    /* 0x94 : ef_key_slot_5_w1 */
    union {
        struct {
            uint32_t ef_key_slot_5_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w1;

    /* 0x98 : ef_key_slot_5_w2 */
    union {
        struct {
            uint32_t ef_key_slot_5_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w2;

    /* 0x9C : ef_key_slot_5_w3 */
    union {
        struct {
            uint32_t ef_key_slot_5_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_5_w3;

    /* 0xA0 : ef_key_slot_6_w0 */
    union {
        struct {
            uint32_t ef_key_slot_6_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_6_w0;

    /* 0xA4 : ef_key_slot_6_w1 */
    union {
        struct {
            uint32_t ef_key_slot_6_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_6_w1;

    /* 0xA8 : ef_key_slot_6_w2 */
    union {
        struct {
            uint32_t ef_key_slot_6_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_6_w2;

    /* 0xAC : ef_key_slot_6_w3 */
    union {
        struct {
            uint32_t ef_key_slot_6_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_6_w3;

    /* 0xB0 : ef_key_slot_7_w0 */
    union {
        struct {
            uint32_t ef_key_slot_7_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_7_w0;

    /* 0xB4 : ef_key_slot_7_w1 */
    union {
        struct {
            uint32_t ef_key_slot_7_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_7_w1;

    /* 0xB8 : ef_key_slot_7_w2 */
    union {
        struct {
            uint32_t ef_key_slot_7_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_7_w2;

    /* 0xBC : ef_key_slot_7_w3 */
    union {
        struct {
            uint32_t ef_key_slot_7_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_7_w3;

    /* 0xC0 : ef_key_slot_8_w0 */
    union {
        struct {
            uint32_t ef_key_slot_8_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_8_w0;

    /* 0xC4 : ef_key_slot_8_w1 */
    union {
        struct {
            uint32_t ef_key_slot_8_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_8_w1;

    /* 0xC8 : ef_key_slot_8_w2 */
    union {
        struct {
            uint32_t ef_key_slot_8_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_8_w2;

    /* 0xCC : ef_key_slot_8_w3 */
    union {
        struct {
            uint32_t ef_key_slot_8_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_8_w3;

    /* 0xD0 : ef_key_slot_9_w0 */
    union {
        struct {
            uint32_t ef_key_slot_9_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_9_w0;

    /* 0xD4 : ef_key_slot_9_w1 */
    union {
        struct {
            uint32_t ef_key_slot_9_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_9_w1;

    /* 0xD8 : ef_key_slot_9_w2 */
    union {
        struct {
            uint32_t ef_key_slot_9_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_9_w2;

    /* 0xDC : ef_key_slot_9_w3 */
    union {
        struct {
            uint32_t ef_key_slot_9_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_9_w3;

    /* 0xE0 : ef_key_slot_10_w0 */
    union {
        struct {
            uint32_t ef_key_slot_10_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_10_w0;

    /* 0xE4 : ef_key_slot_10_w1 */
    union {
        struct {
            uint32_t ef_key_slot_10_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_10_w1;

    /* 0xE8 : ef_key_slot_10_w2 */
    union {
        struct {
            uint32_t ef_key_slot_10_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_10_w2;

    /* 0xEC : ef_key_slot_10_w3 */
    union {
        struct {
            uint32_t ef_key_slot_10_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_key_slot_10_w3;

    /* 0xF0 : ef_dat_1_rsvd_0 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_0;

    /* 0xF4 : ef_dat_1_rsvd_1 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_1;

    /* 0xF8 : ef_dat_1_rsvd_2 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_2;

