XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_data_1_reg.h
    /* 0xFC : ef_data_1_lock */
    union {
        struct {
            uint32_t wr_lock_rsvd_1       : 15; /* [14: 0],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4   : 1;  /* [   15],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_6   : 1;  /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_7   : 1;  /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_8   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_9   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_10  : 1;  /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_0 : 1;  /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_1 : 1;  /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_2 : 1;  /* [   24],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_4   : 1;  /* [   25],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_5   : 1;  /* [   26],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_6   : 1;  /* [   27],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_7   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_8   : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_9   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_10  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_data_1_lock;
};

typedef volatile struct ef_data_1_reg ef_data_1_reg_t;

#endif /* __EF_DATA_1_REG_H__ */
